[{"data": {"id": "k", "name": "Moon to discuss economic cooperation, denuclearization with Putin", "parent": "B", "topic": ["moon"], "date": "2018-06-21T15:26:00", "contents": "President Moon Jae-in on Thursday set out on a state visit to Russia, where he is expected to discuss economic cooperation and denuclearization with President Vladimir Putin.Moon will kick off his trip by addressing the State Duma for the first time for a South Korean president, and meet with Russian Prime Minister Dmitry Medvedev.", "erasable": false}, "group": "nodes", "position": {"x": 250, "y": 100}}, {"data": {"id": "B", "name": "S.Korea, Russia to begin preparations for FTA negotiations: Moon", "date": "2018-06-22T16:32:00", "contents": "President Moon Jae-in on Friday announced a plan to launch negotiations for South Korea’s first free trade agreement with Russia, calling for joint efforts to boost the two countries’ bilateral trade to over $30 billion by 2020. /n During a business forum in Moscow, Moon said he would agree with Russian President Vladimir Putin to begin domestic processes aimed at launching FTA negotiations related to the service and investment sector. The South Korean president said that he expects the FTA to encompass agreements on goods as well, urging the two countries to reach a “comprehensive, mutually-beneficial” agreement “as soon as possible.", "topic": ["moon"], "erasable": true}, "group": "nodes", "position": {"x": 400, "y": 99}}, {"data": {"id": "d", "name": "S.Korea, Russia to begin preparations for FTA negotiations: Moon", "date": "2018-06-22T16:32:00", "contents": "President Moon Jae-in on Friday announced a plan to launch negotiations for South Korea’s first free trade agreement with Russia, calling for joint efforts to boost the two countries’ bilateral trade to over $30 billion by 2020. /n During a business forum in Moscow, Moon said he would agree with Russian President Vladimir Putin to begin domestic processes aimed at launching FTA negotiations related to the service and investment sector. The South Korean president said that he expects the FTA to encompass agreements on goods as well, urging the two countries to reach a “comprehensive, mutually-beneficial” agreement “as soon as possible.", "parent": "B", "topic": ["moon"], "erasable": false}, "group": "nodes", "position": {"x": 550, "y": 107}}, {"data": {"id": "c", "name": "Korea hasn't scored a goal, Son Heung-min has", "topic": ["soccer", "moon"], "date": "2018-06-24T17:34:00", "contents": "Ecstatic screams broke out among Korean World Cup fans Saturday night when Son Heung-min fired a projectile shoot that cut through eight defending players and flew in to the net, moments before the final whistle.South Korea lost 2-1 against Mexico, but Son’s stunning shoot and his subsequent sob of regret at losing the match became a trending topic on Twitter the next day. Mexico had scored two goals and the second half was about to come to a close, when Son dealt a breakthrough shoot, the first shoot Korea made in this World Cup.", "erasable": false}, "group": "nodes", "position": {"x": 700, "y": 96}}, {"data": {"id": "e", "name": "President Moon down with flu", "date": "2018-06-27T20:54:00", "contents": "President Moon Jae-in has called off his entire schedule for the remainder of the week as advised by his doctor, the presidential office Cheong Wa Dae said Wednesday, adding the president is down with the flu.", "topic": ["moon"], "erasable": false}, "group": "nodes", "position": {"x": 850, "y": 103}}, {"data": {"id": "a", "name": "Korea to take on Mexico in crucial 2nd match", "date": "2018-06-21T16:31:00", "contents": "SAINT PETERSBURG, Russia -- South Korea will try to upset Mexico to keep alive their hopes of advancing to the knockout rounds at the 2018 FIFA World Cup.South Korea, ranked 57th in the latest FIFA rankings, and Mexico, world No. 15, will go head-to-head at Rostov Arena in Rostov-on-Don, Russia, on Saturday for their second match in Group F, where they are also paired with Sweden and Germany.The teams are in different situations after their first matches, but one thing is for certain: neither South Korea nor Mexico are going to be satisfied with a draw.Mexico find themselves in a good position to qualify for the round of 16, which they've been done for the last six World Cups, after collecting a stunning 1-0 win over defending champions Germany on Sunday. South Korea, on the other hand, are facing elimination with a 1-0 defeat to Sweden on Monday as stronger opponents await them.", "topic": ["soccer"], "erasable": false}, "group": "nodes", "position": {"x": 250, "y": 255}}, {"data": {"id": "b", "name": "S.Korea fall to Mexico 2-1 for 2nd straight loss", "date": "2018-06-24T02:06:00", "contents": "ROSTOV-ON-DON, Russia -- South Korea fell to Mexico 2-1 for their second straight loss at the FIFA World Cup in Russia on Saturday, though their hopes of advancing to the knockout stage are still alive thanks to Germany.Son Heung-min's stunner in second-half stoppage time wasn't nearly enough for South Korea at Rostov Arena in Rostov-on-Don, about 1,000 kilometers south of Moscow. Carlos Vela scored on a 26th-minute penalty, and Javier Hernandez doubled Mexico's advantage in the 66th, with South Korea only managing one goal in response.Having earlier stunned defending champions Germany, Mexico are sitting pretty atop Group F with six points.", "topic": ["soccer"], "erasable": false}, "group": "nodes", "position": {"x": 400, "y": 243}}, {"data": {"id": "f", "name": "Preparing for a miracle, S.Korea polish up tactics for match vs. Germany", "date": "2018-06-26T10:02:00", "contents": "SAINT PETERSBURG, Russia -- Trying to make a miracle, S. Korea on Monday conducted their tactical training for the upcoming 2018 FIFA World Cup match against Germany behind closed doors.South Korea will face Germany at Kazan Arena in Kazan on Wednesday for their last match in Group F. Although chances appear to be slim, South Korea can still advance to the round of 16 even though they have dropped their last two matches.If they beat Germany and Sweden lose to Mexico, then the three teams excluding Mexico would be tied at one win and two losses, meaning tiebreakers would determine their fate.", "parent": "A", "topic": ["soccer"], "erasable": false}, "group": "nodes", "position": {"x": 850, "y": 244}}, {"data": {"id": "A", "name": "S.Korea stun Germany on way out of World Cup", "date": "2018-06-28T01:03:00", "contents": "KAZAN, Russia -- South Korea stunned Germany 2-0 while being eliminated in the group stage at the FIFA World Cup on Wednesday, bringing the defending champions down with them.", "topic": ["soccer"], "erasable": true}, "group": "nodes", "position": {"x": 1000, "y": 251}}, {"data": {"id": "g", "name": "S.Korea stun Germany on way out of World Cup", "date": "2018-06-28T01:03:00", "contents": "KAZAN, Russia -- South Korea stunned Germany 2-0 while being eliminated in the group stage at the FIFA World Cup on Wednesday, bringing the defending champions down with them.", "parent": "A", "topic": ["soccer"], "erasable": false}, "group": "nodes", "position": {"x": 1150, "y": 241}}, {"data": {"id": "h", "name": "S.Korea avoid dishonorable records with win over Germany", "date": "2018-06-28T09:44:00", "contents": "KAZAN, Russia -- South Korea avoided dishonorable records in their football history with their historic win over Germany at the 2018 FIFA World Cup on Wednesday.South Korea blanked defending champions Germany 2-0 in their final Group F match at Kazan Arena in Kazan, some 800 kilometers east of Moscow. This was South Korea's first win at the 2018 World Cup after losing 1-0 to Sweden and falling 2-1 to Mexico. Shin Tae-yong's side finished third in Group F ahead of Germany.The loss against the world's No. 1 team would have forced South Korea to return home with three straight losses. Since making their World Cup debut in 1954, South Korea have only finished the tournament with three losses only once. The Taeguk Warriors went home with three defeats at the 1990 World Cup in Italy where they faced Spain, Belgium and Uruguay in the group stage.", "parent": "A", "topic": ["soccer"], "erasable": false}, "group": "nodes", "position": {"x": 1300, "y": 253}}, {"data": {"source": "a", "target": "b", "topic": ["soccer"]}, "group": "edges"}, {"data": {"source": "b", "target": "c", "topic": ["soccer"]}, "group": "edges"}, {"data": {"source": "d", "target": "c", "topic": ["moon"]}, "group": "edges"}, {"data": {"source": "c", "target": "e", "topic": ["moon"]}, "group": "edges"}, {"data": {"source": "c", "target": "f", "topic": ["soccer"]}, "group": "edges"}, {"data": {"source": "f", "target": "g", "topic": ["soccer"]}, "group": "edges"}, {"data": {"source": "g", "target": "h", "topic": ["soccer"]}, "group": "edges"}, {"data": {"source": "k", "target": "d", "topic": ["moon"]}, "group": "edges"}]
